#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КонтрольСроковУплатыПоСтатьям");
	НастройкиВарианта.Описание = НСтр("ru = 'Сроки уплаты НДФЛ с детализацией по источникам финансирования.
											|Данные о перечисленном налоге показываются по 2023 год включительно.';
											|en = 'TIN payment terms with funding source details.
											|The data on the transferred tax is shown up to and including 2023.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КонтрольСроковУплатыПоИсточникам");
	НастройкиВарианта.Описание = НСтр("ru = 'Сроки уплаты НДФЛ с детализацией по источникам финансирования.
											|Данные о перечисленном налоге показываются по 2023 год включительно.';
											|en = 'TIN payment terms with funding source details.
											|The data on the transferred tax is shown up to and including 2023.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "УдержанныйНДФЛ");
	НастройкиВарианта.Описание = НСтр("ru = 'Удержанный налог в разрезе дат удержания, документов (ведомостей) и крайнего срока уплаты.
											|Данные о перечисленном налоге показываются по 2023 год включительно.';
											|en = 'Tax deducted by deduction dates, documents (statements), and payment due date.
											|The data on the transferred tax is shown up to and including 2023.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "УдержанныйНДФЛПоСтатьям");
	НастройкиВарианта.Описание = НСтр("ru = 'Удержанный налог в разрезе дат удержания, источников финансирования,
												|документов (ведомостей) и крайнего срока уплаты.
												|Данные о перечисленном налоге показываются по 2023 год включительно.';
												|en = 'Tax deducted by deduction dates, funding sources,
												|documents (statements), and payment due date.
												|The data on the transferred tax is shown up to and including 2023.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "УдержанныйНДФЛПоИсточникам");
	НастройкиВарианта.Описание = НСтр("ru = 'Удержанный налог в разрезе дат удержания, источников финансирования,
												|документов (ведомостей) и крайнего срока уплаты.
												|Данные о перечисленном налоге показываются по 2023 год включительно.';
												|en = 'Tax deducted by deduction dates, funding sources,
												|documents (statements), and payment due date.
												|The data on the transferred tax is shown up to and including 2023.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти
	
#КонецЕсли