
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СчетчикВсего > 1 Тогда
		ВсегоСообщений = ПолучитьСклоненияСтрокиПоЧислу("сообщение", Параметры.СчетчикВсего, "",
				"ЧС=Количественное", "ПД=Родительный");
		Шаблон = НСтр("ru = '%1 из %2';
						|en = '%1 out of %2'");
		КоличествоСообщений = СтрШаблон(Шаблон, Параметры.СчетчикОшибок, ВсегоСообщений[0]);
		ТекстСообщения = НСтр("ru = 'сообщения';
								|en = 'messages'");
		Элементы.ЧтоДелать2.Заголовок = СтрЗаменить(Элементы.ЧтоДелать2.Заголовок,
			"%сообщения%", ТекстСообщения);
		Элементы.ФормаПодключитьФоновоеЗадание.Заголовок = СтрЗаменить(Элементы.ФормаПодключитьФоновоеЗадание.Заголовок,
			"%сообщения%", ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'сообщение';
								|en = 'message'");
		Элементы.ЧтоДелать2.Заголовок = СтрЗаменить(Элементы.ЧтоДелать2.Заголовок,
			"%сообщения%", ТекстСообщения);
		Элементы.ФормаПодключитьФоновоеЗадание.Заголовок = СтрЗаменить(Элементы.ФормаПодключитьФоновоеЗадание.Заголовок,
			"%сообщения%", ТекстСообщения);
		КоличествоСообщений = НСтр("ru = '1 сообщение';
									|en = '1 message'");
	КонецЕсли;
	
	ИнформационнаяБазаФайловая = ОнлайнСервисыРегламентированнойОтчетностиВызовСервера.ИнформационнаяБазаФайловая();
	Если ИнформационнаяБазаФайловая Тогда
		ИформацияДляФайловойбазы = НСтр("ru = ', однако вам необходимо оставить программу открытой';
										|en = ', leave the application open'");
		Элементы.ЧтоДелать2.Заголовок = СтрЗаменить(Элементы.ЧтоДелать2.Заголовок,
			"%ИформацияДляФайловойбазы%", ИформацияДляФайловойбазы);
	Иначе
		ИформацияДляФайловойбазы = "";
		Элементы.ЧтоДелать2.Заголовок = СтрЗаменить(Элементы.ЧтоДелать2.Заголовок,
			"%ИформацияДляФайловойбазы%", ИформацияДляФайловойбазы);
	КонецЕсли;
	
	ЧтоДелатьЗаголовок = Элементы.ЧтоДелать.Заголовок;
	ЧтоДелатьЗаголовок = СтрЗаменить(ЧтоДелатьЗаголовок, "%1", КоличествоСообщений);
	Элементы.ЧтоДелать.Заголовок = СтроковыеФункции.ФорматированнаяСтрока("<b>" + ЧтоДелатьЗаголовок + "</b>");
	
	ДокументооборотСКОВызовСервера.ДобавитьСсылкуНаРекомендации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НадписьРекомендацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "РекомендацииСЭДО" Тогда
		СтандартнаяОбработка = Ложь;	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Действие", "ПолучениеСообщений");   
		
		ОткрытьФорму("ОбщаяФорма.РекомендацииСЭДО", 
			ПараметрыФормы, 
			ЭтотОбъект, 
			УникальныйИдентификатор, , , , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьРегламентноеЗадание(Команда)
	
	ЭтотОбъект.Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти